/*Яша плавал в бассейне размером N×M метров и устал. 
В этот момент он обнаружил, что находится на расстоянии X метров от одного из длинных бортиков (не обязательно от ближайшего) и Y метров от одного из коротких бортиков. 
Какое минимальное расстояние должен проплыть Яша, чтобы выбраться из бассейна на бортик?

Программа получает на вход числа N, M, X, Y.
Программа должна вывести число метров, которое нужно проплыть Яше до бортика.*/

#include <iostream>
using namespace std;
int main() {
  int  N, M, X, Y;
  cin >> N >> M >> X >> Y;
  if (N>M) {
      swap (N,M);
  }
  if (Y<=M-Y && Y<=N-X && Y<=X)
      cout<<Y;
  else if (X<=M-Y && X<=N-X && X<Y)
      cout<<X;
  else if (M-Y<Y && M-Y<=N-X && M-Y<=X)
      cout<<M-Y;
  else
      cout<<N-X;
  return 0;
}