/*Дано четырехзначное число. Определите, является ли его десятичная запись симметричной.
Если число симметричное, то выведите 1, иначе выведите любое другое целое число. 
Число может иметь меньше четырех знаков, тогда нужно считать, что его десятичная запись дополняется слева незначащими нулями.
Вводится единственное число.
Выведите одно целое число - ответ на задачу.*/

#include <iostream>
using namespace std;
int main() {
  int N;
  cin >>N;
  cout << (N-((N%10)*1000+((N%100)/10)*100+((N%1000)/100)*10+N/1000))+1;
  return 0;
}